import gif from "../assets/Animation.gif";
const Analiz = () => {

    const animStyle = {
        textAlign: "center"
    }

    return (
        <div className="main-content">
            <h1>Анализ программных сред</h1>
            <table>
                <tbody>
                <tr>
                    <td width="256">
                        <p>Название программной среды</p>
                    </td>
                    <td width="381">
                        <p>Критерии</p>
                    </td>
                </tr>
                <tr>
                    <td width="256">
                        <p>MS Publisher</p>
                    </td>
                    <td width="381">
                        <p>Эта НИС содержит достаточный для оформления публикации набор функций. Она удобна для начинающих пользователей простой инсталляцией и средствами, облегчающими процесс создания публикаций.</p>
                    </td>
                </tr>
                <tr>
                    <td width="256">
                        <p>Adobe PageMaker</p>
                    </td>
                    <td width="381">
                        <p>Популярная программа с многочисленными функциями, позволяющая удобно работать с журнальными и газетными многостраничными публикациями. Программа содержит большое количество функций по оформлению публикаций, многие полезные функции добавлены в этот пакет с помощью дополнительных утилит (вспомогательных программ)</p>
                    </td>
                </tr>
                <tr>
                    <td width="256">
                        <p>Corel Ventura</p>
                    </td>
                    <td width="381">
                        <p>Программа, которая была одной из первых НИС. Она ориентируется на создание книг, брошюр, журналов и других больших многостраничных публикаций. Программа обладает большими возможностями по размещению и оформлению текста. Последняя версия программы распространяется с пакетом&nbsp;CorelDraw&nbsp;, элементы которого позволяют создать высококачественные иллюстрации</p>
                    </td>
                </tr>
                <tr>
                    <td width="256">
                        <p>QuarkXPress</p>
                    </td>
                    <td width="381">
                        <p>НИС для профессиональной работы. Включает большое количество функций по оформлению публикации любой сложности и содержания. Разнообразные возможности позволяют реализовать любые проекты по дизайну. Она также имеет дополнительные утилиты, расширяющие возможности программы</p>
                    </td>
                </tr>
                <tr>
                    <td width="256">
                        <p>FrameMaker</p>
                    </td>
                    <td width="381">
                        <p>НИС, наиболее удобная для работы с большими публикациями, которые имеют сложную структуру, например технические публикации. В программе можно работать с различными иллюстрациями, а также легко оформлять таблицы и формулы, но программа имеет ограниченные функциональные возможности по сравнению с&nbsp;Corel Ventura<strong><strong>&nbsp;</strong></strong></p>
                    </td>
                </tr>
                </tbody>
            </table>
            <p>&nbsp;</p>
            <p>
                <img src={gif} alt="gif" style={animStyle}/>
            </p>
        </div>
    )
}

export default Analiz;