const Conclusion = () => {
    return (
        <div className="main-content">
            <h1>Заключение</h1>
            <p>Издательские системы представляют собой комплекс аппаратного и программного обеспечения, предназначенного
                для публикаций из текста и изображений для печати, так же их классифицируют на аппаратный, программный и
                пользовательский уровни. Они применяются для профессиональной деятельности и позволяют решать ряд задач.
                НИС делятся на программы для подготовки полиграфических изданий и системы верстки электронных
                документов. Вместе с этим выделяют три категории печатной продукции, требующей для подготовки
                издательские системы разного уровня. Основные функции издательских систем довольно обширны: от
                использования различных видов шрифтов до редактирования изображений. Начало НИС было положено в 1985
                году, когда вышла созданная корпорацией Aldus программа PageMaker и персональный лазерный принтер
                LaserWriter компании Apple Computer. Термин &laquo;desktop publishing&raquo; был предложен Полом
                Брейнердом, основателем Aldus Corporation. Постепенно на рынке появлялись новые программы - Ventura
                Publisher, Adobe PageMaker, MS Publisher, QuarkXPress, Adobe InDesign. Все они прошли долгий путь в
                улучшении своих функций и возможностей. Прекрасной программой для начинающих показал себя MS Publisher.
                Программа довольно проста в освоении и имеет богатую коллекцию шаблонов для подготовки разного рода
                публикаций. Линейка Adobe PageMaker больше не разрабатывается, однако компания не закрывает программу,
                потому что не только многие специалисты, но и некоторые издательства продолжают пользоваться данным
                продуктом. Corel Ventura имеет уникальную концепцию тегов и ряд функций, однако нестабильность ПО ведет
                23 к ошибкам сохранения публикаций и медленной работе, в последней версии программы данный дефект не
                устраняется. На сегодняшний день на издательском рынке за право первенства борются две профессиональные
                программы &ndash; QuarkXPress и Adobe InDesign. Данные платформы мало в чем отличаются по функциональным
                возможностям, и все равно вызывают споры среди специалистов.</p>
        </div>
    )
}

export default Conclusion;