import img from "../assets/vids.gif";

const Concept = () => {
    const ListStyle = {
        listStyle: 'circle'
    }
    const imgStyle = {
        textAlign: 'center'
    }
    return (
        <div className="main-content">
            <h1>Понятие настольная издательская система</h1>
            <p>&nbsp;</p>
            <p>На рубеже 20 и 21 веков появилось такое понятие как компьютерные издательские технологии (КИТ). КИТ - подготовка изданий средствами настольных издательских систем.[5]</p>
            <p>Настольная извдательская система (НИС, DPT - Desktop Publising System)&nbsp;- комплекс аппаратного и программного обеспечения, предназначенный для подготовки публикации из текста и изображений для печати. Также возможна и подготовка документа публикации для распространения не в виде твердой копии, а в электронном виде, т. е. электронная верстка в PDF- и HTMLформатах. Настольное издательство, в отличие от традиционного типографского, подразумевает полиграфическую работу не в типографии, а дома или в офисе.[8]</p>
            <h5>Структура НИС подразумевает три уровня:</h5>
            <ul style={ListStyle}>
                <li>аппаратный (устройства, с помощью которых производятся ввод, обработка, хранение, передача и вывод данных на печать);</li>
                <li>программный (совокупность программ, осуществляющих управление аппаратными средствами и поддержку процесса верстки документа);</li>
                <li>пользовательский (специалисты и обычные пользователи, создающие публикации или творческие произведения);</li>
            </ul>
            <p style={imgStyle}>
                <img src={img} alt="img"/>
            </p>
            <p>&nbsp;</p>
            <p>НИС применяются для профессиональной издательской деятельности. Позволяют осуществлять электронную верстку широкого спектра основных типов документов типа информационного бюллетеня, цветной брошюры, каталога, справочника.[2]&nbsp;С их помощью решаются задачи по компоновке текста, используются всевозможные шрифты и выполняются полиграфические изображения, осуществляется редактирование текста, обрабатываются графические изображения, выводятся документы полиграфического качества. И, конечно же, присутствует возможность работы в сетях на разных платформах.</p>
            <p>&nbsp;</p>
            <h2>Виды издательских систем и их особенности</h2>
            <p>&nbsp;</p>
            <p>Издательские системы делятся на программы для подготовки полиграфических изданий и системы верстки электронных документов. От масштаба проекта зависит выбор пользователем аппаратных средств и программного обеспечения. Так, можно выделить три уровня печатной продукции, требующих для подготовки издательские системы соответствующего уровня сложности:</p>
            <p>&minus; &laquo;Черно-белый информационный бюллетень средних размеров, журнал, книга, издаваемая, как правило, одним лицом;</p>
            <p>&minus; Журнал или книга с цветными иллюстрациями, печатающиеся на &laquo;стороне&raquo;, для которых оправданно обращение к сторонним организациям для высококачественного сканирования и вывода на финальные пленки с высоким разрешением;</p>
            <p>&minus; Большая газета, журнал или иллюстрированная книга, сильно &laquo;нагруженные&raquo; цветными иллюстрациями, для которых экономически оправданно содержать весь процесс издания, завершающийся слайдами, с которых будет производиться печать;[10]&nbsp;</p>
            <p>Чтобы выполнить работу первого понадобится система базовой комплектации с возможными вариациями в зависимости от бюджета фирмы. Для работы второго уровня потребуется усиление некоторых компонентов базового уровня, а также более совершенное программное обеспечение и дополнительное оборудование. Комплекс для выполнения работы третьего уровня нельзя назвать ни персональным, ни настольным, для него понадобится специализированное оборудование. Так же стоит отметить, что каждый последующий уровень 8 включает предыдущий с некоторыми расширениями и дополнениями, а вместе с этим в структуре работы содержатся рабочие места как первого, так и второго уровней.</p>
            <p>Основные функции издательских систем следующие: использование сотен различных видов шрифтов (начертаний и размеров символов текста), которые отображаются на экране так же, как при печати; размещение фрагментов в документе, изменения и корректировка рисунков и диаграмм; растягивание букв в тексте (разрядка), сближение их друг с другом; подготовка таблиц; выравнивание нижнего края текста на странице на заданную границу (чтобы страницы документа имели единообразный вид); набор формул и т.д.[1]</p>
            <p>&nbsp;</p>
        </div>
    )
}

export default Concept;