const Introduction = () => {
    return (
        <div className="main-content">
            <h1>Введение</h1>
            <p>&nbsp;</p>
            <p>Современная цифровая полиграфия уже не может обойтись без специализированных программ верстки. От
                листовок до толстых книг &ndash; на сегодняшний день все это создается в программах. Современным
                специалистам издательского дела сложно представить себя за склейкой текста вручную, за подбором нужного
                кегля для заголовков и колонок, для них невообразимо, что фотографию нельзя обработать в редакторе перед
                отправкой в печать, а ведь именно так и работали их предшественники &ndash; они подолгу сидели в
                помещениях и собирали будущее издание вручную.</p>
            <p>С наступлением эры цифровых технологий процесс верстки заметно упростился, а сфера распространения
                издательской продукции, напротив, увеличилась. Так, в настоящее время популярностью пользуются не только
                печатные, но и электронные средства информации, подготовить которые было бы невозможно без помощи
                издательских систем. Так же, на сегодняшний день нет ни одного издательства, которое бы не использовало
                в работе программы верстки.</p>
            <p>&nbsp;</p>
        </div>
    )
}

export default Introduction;