const Opportunity = () => {
    return (
        <div className="main-content">
            <h1>Возможности издательских систем и их история</h1>
            <p>&nbsp;</p>
            <p>Начало НИС было положено в 1985 году, когда вышла созданная корпорацией Aldus программа PageMaker и
                персональный лазерный принтер LaserWriter компании Apple Computer. Возможность создания WYSIWYG макетов
                страницы на экране монитора с последующей распечаткой на принтере была новой как для компьютерной
                индустрии, так и для типографского дела. Термин &laquo;desktop publishing&raquo; был предложен Полом
                Брейнердом, основателем Aldus Corporation.</p>
            <p>Ранние настольные издательские системы на сегодняшний день выглядят весьма примитивными. Связка
                PageMaker-LaserWriter-Macintosh 512K была не совсем стабильной, часто зависала, использовался
                чёрно-белый экран, невозможно было контролировать кернинг, трекинг и другие важные параметры
                типографики. Но в то время отзывы о системе были одобрительными.</p>
            <p>Технологии, разработанные Adobe Systems, заложили фундамент для дальнейшего развития профессионального
                издательского ПО. Принтеры LaserWriter и LaserWriter Plus содержали во встроенной ROM-памяти
                масштабируемые шрифты от Adobe.</p>
            <p>В 1986 году вышла программа Ventura Publisher для компьютеров под ОС MS-DOS. В то время как PageMaker
                имитировала процесс создания макета страницы вручную, Ventura Publisher автоматизировала этот процесс
                путём использования тэгов и таблиц стилей, что позволило автоматизировать процесс создания индексов и
                элементов макета страницы. Таким образом, Ventura Publisher была удобнее PageMaker при создании макетов
                книг и многостраничных документов.</p>
            <p>В то время НИС воспринимались как непригодные для широкого использования, во многом из-за пользователей,
                которые использовали непрофессионально спроектированные макеты. Тем не менее, профессиональное
                использование издательских программ позволяло уже тогда получить хорошие результаты.</p>
            <p>Улучшение и расширение инструментов для работы с текстом и графикой для компьютеров привлекло внимание
                профессионального сообщества к издательскому ПО. Переломным моментом стало появление в 1990-х годах
                программы QuarkXPress, а также расширение базы компьютерных шрифтов. QuarkXPress стала доминирующей
                системой на рынке. В начале 2000-х набрала популярность программа Adobe InDesign. Это произошло
                благодаря её большим возможностям, а также интеграции с другими программами от Adobe, которые были
                доминирующими в сфере компьютерного дизайна, обработки изображений и фотографий, аудио- и видео
                редактирования [6].</p>
            <p>На сегодняшний день компьютерные технологии издательского дела позволяют проводить следующие
                операции:</p>
            <p>&minus; обработка изображений (создавать и обрабатывать иллюстративные материалы: преобразовывать готовые
                изображения, созданные на каком-либо материальном носителе в цифровую форму; создавать иллюстративный
                материал сразу в цифровом виде);</p>
            <p>&minus; разработка полиграфического дизайна (создавать самостоятельные графические продукты: фирменные
                знаки, визитки, бланки, объявления, афиши, пригласительные билеты, открытки и т.д.);</p>
            <p>&minus; разработка изданий (газет, книг, журналов, брошюр, многостраничного документа) с помощью ПК.
                Может включать в себя результаты технологий графики и полиграфического дизайна;&raquo; [3].</p>
            <p>Созданные в 1985 году НИС были недостаточно разработаны, но на сегодняшний день они полностью
                укомплектованы и позволяют, не отрываясь от монитора, редактировать изображения, разрабатывать издания
                или элементы дизайна, что свидетельствует о становлении НИС как основной технологии на рынке
                полиграфии.</p>
            <p>&nbsp;</p>
            <p>&nbsp;</p>
        </div>
    )
}

export default Opportunity;