const Systems = () => {
    return (
        <div className="main-content">
            <p>&nbsp;</p>
            <h1>Системы верстки электронных документов</h1>
            <p>Основые типы издательских объектов и работа с ними</p>
            <p>Выделяют три типа объектов, с которыми работает издательская система &ndash; это текстовые блоки,
                графические объекты и стандартные элементы оформления (рамки, линии, узоры).</p>
            <p>Текстовый блок подразумевает под собой какой-то фрагмент текста, чей размер может колебаться от одного
                символа до целого документа. Создать текстовый блок можно посредством ввода через клавиатуру или с
                помощью функции &laquo;копировать&raquo;, которая присутствует в любом текстовом редакторе. Чтобы
                обозначить блок, с которым предстоит работать, его выделяют с помощью клавиатуры, мыши или других
                методов.</p>
            <p>Графические объекты условно делятся на рисунки и графические изображения. Рисунками чаще всего являются
                файлы, которые импортируются или создаются в других программах. Графические изображения &ndash; это
                любой нарисованный или вставленный объект, который можно редактировать или форматировать.</p>
            <p>Выделяют несколько видов стандартных элементов оформления, таких как рамки (Приложение А), линии
                (Приложение Б) и узоры (Приложение В). Рамки могут быть геометрическими, т.е. имеющие форму фигур
                (квадрата, прямоугольника, овала и т.д.), и декоративными &ndash; их создают с помощью комбинирования
                нескольких элементов (знаков, символов, графических изображений и пр.). Линии используют, чтобы отделять
                части текста друг от друга, это довольно хорошо распространено в газетно-журнальных изданиях. Их так же
                могут использовать в книгах для отделения колонтитулов от основного текста. Узоры используются как
                декоративный элемент и чаще применяются в художественных изданиях для поддержания эстетических качеств
                книги.</p>
            <p>Все объекты проходят предварительную обработку в текстовых процессорах или графических редакторах и
                поступают на верстку в готовом 12 виде. Исходные файлы помещают в издательскую систему либо через буфер
                обмена, либо с помощью импортирования. Каждая НИС имеет свои возможности по копированию и импортированию
                файлов</p>
            <p>&nbsp;</p>
        </div>
    )
}
export default Systems;